
<template>
    <div class="scroll-wrapper" ref="scroll">
        <div class="scroll-content">
            <div
                class="scroll-item"
                v-for="(item, index) of 100"
                :key="index"
                @click="clickHandler(item)"
            >
                {{ item }}
            </div>
        </div>
    </div>
</template>

<script>
import BScroll from "@better-scroll/core";

export default {
    name: "HomePage",
    data() {
        return {
            emojis: [
                "😀 😁 😂 🤣 😃",
                "😄 😅 😆 😉 😊",
                "😫 😴 😌 😛 😜",
                "👆🏻 😒 😓 😔 👇🏻",
                "😑 😶 🙄 😏 😣",
                "😞 😟 😤 😢 😭",
                "🤑 😲 ☹️ 🙁 😖",
                "👍 👎 👊 ✊ 🤛",
                "☝️ ✋ 🤚 🖐 🖖",
                "👍🏼 👎🏼 👊🏼 ✊🏼 🤛🏼",
                "☝🏽 ✋🏽 🤚🏽 🖐🏽 🖖🏽",
                "🌖 🌗 🌘 🌑 🌒",
                "💫 💥 💢 💦 💧",
                "🐠 🐟 🐬 🐳 🐋",
                "😬 😐 😕 😯 😶",
                "😇 😏 😑 😓 😵",
                "🐥 🐣 🐔 🐛 🐤",
                "💪 ✨ 🔔 ✊ ✋",
                "👇 👊 👍 👈 👆",
                "😀 😁 😂 🤣 😃",
                "😄 😅 😆 😉 😊",
                "😫 😴 😌 😛 😜",
                "👆🏻 😒 😓 😔 👇🏻",
                "😑 😶 🙄 😏 😣",
                "😞 😟 😤 😢 😭",
                "😀 😁 😂 🤣 😃",
                "😄 😅 😆 😉 😊",
                "😫 😴 😌 😛 😜",
                "👆🏻 😒 😓 😔 👇🏻",
                "😑 😶 🙄 😏 😣",
                "😞 😟 😤 😢 😭",
                "🤑 😲 ☹️ 🙁 😖",
                "👍 👎 👊 ✊ 🤛",
                "☝️ ✋ 🤚 🖐 🖖",
                "👍🏼 👎🏼 👊🏼 ✊🏼 🤛🏼",
                "☝🏽 ✋🏽 🤚🏽 🖐🏽 🖖🏽",
                "🌖 🌗 🌘 🌑 🌒",
                "💫 💥 💢 💦 💧",
                "🐠 🐟 🐬 🐳 🐋",
                "😬 😐 😕 😯 😶",
                "😇 😏 😑 😓 😵",
                "🐥 🐣 🐔 🐛 🐤",
                "💪 ✨ 🔔 ✊ ✋",
                "👇 👊 👍 👈 👆",
                "😀 😁 😂 🤣 😃",
                "😄 😅 😆 😉 😊",
                "😫 😴 😌 😛 😜",
                "👆🏻 😒 😓 😔 👇🏻",
                "😑 😶 🙄 😏 😣",
                "😞 😟 😤 😢 😭",
                "😀 😁 😂 🤣 😃",
                "😄 😅 😆 😉 😊",
                "😫 😴 😌 😛 😜",
                "👆🏻 😒 😓 😔 👇🏻",
                "😑 😶 🙄 😏 😣",
                "😞 😟 😤 😢 😭",
                "🤑 😲 ☹️ 🙁 😖",
                "👍 👎 👊 ✊ 🤛",
                "☝️ ✋ 🤚 🖐 🖖",
                "👍🏼 👎🏼 👊🏼 ✊🏼 🤛🏼",
                "☝🏽 ✋🏽 🤚🏽 🖐🏽 🖖🏽",
                "🌖 🌗 🌘 🌑 🌒",
                "💫 💥 💢 💦 💧",
                "🐠 🐟 🐬 🐳 🐋",
                "😬 😐 😕 😯 😶",
                "😇 😏 😑 😓 😵",
                "🐥 🐣 🐔 🐛 🐤",
                "💪 ✨ 🔔 ✊ ✋",
                "👇 👊 👍 👈 👆",
                "😀 😁 😂 🤣 😃",
                "😄 😅 😆 😉 😊"
            ]
        };
    },

    components: {},

    computed: {},

    methods: {
        init() {
            // 实例化better-scroll
            this.bs = new BScroll(this.$refs.scroll, {
                scrollY: true,
                click: true,
                startY: 0,
                probeType: 3 // listening scroll hook
            })
        },

        clickHandler(item) {
            this.$router.push({ name: "towPage", params: { info: item } });
        }
    },

    created() {
        console.log("created")
    },

    mouted() {
        console.log("mounted");
    },

    activated() {
        console.log("activated");
        this.bs.refresh();
    },

    beforeDestroy() {
        console.log("beforeDestroy")
        this.bs.destroy();
    }
};
</script>

<style lang="stylus" scoped>
.scroll-wrapper {
    position: fixed;
    top: 1.1rem;
    left: 0;
    width: 100%;
    height: calc(100% - 2.2rem);
    overflow: hidden;
    z-index: 111;

    .scroll-content {
        min-height: calc(100% + 1px);

        .scroll-item {
            height: 1rem;
            line-height: 1rem;
            font-size: 0.48rem;
            font-weight: bold;
            border-bottom: 0.02rem solid #eee;
            text-align: center;

            &:nth-child(2n) {
                background-color: #f3f5f7;
            }

            &:nth-child(2n+1) {
                background-color: #42b983;
            }
        }
    }
}
</style>